# Rebar Shape Terminations Data Termination Rotation Angle At End Property

Source: https://www.revitapidocs.com/2026/965aa38e-efb9-0d41-887c-4259f08105fb.htm

---

| Rebar Shape Terminations Data Termination Rotation Angle At End Property |
| --- |

Identifies the termination's (e.g. hook, crank) out of plane rotation angle (in radians) at the end of the rebar shape.

The default value is 0\.

**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double TerminationRotationAngleAtEnd { get; set; }
```

```
Public Property TerminationRotationAngleAtEnd As Double
	Get
	Set
```

```
public:
property double TerminationRotationAngleAtEnd {
	double get ();
	void set (double value);
}
```

```
member TerminationRotationAngleAtEnd : float with get, set
```

#### Property Value

Double Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The given value for terminationRotationAngleAtEnd is not finite |

See Also

#### Reference

RebarShapeTerminationsData Class Autodesk.Revit.DB.Structure Namespace